problem_sets/cfd_suite/Exeter_CFD_Problems/data/PitzDaily/case_fine_adjoint/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       19742;
    }
    outlet
    {
        type            patch;
        nFaces          57;
        startFace       19772;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          223;
        startFace       19829;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          223;
        startFace       20052;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20022;
        startFace       20275;
    }
)

// ************************************************************************* //
